docs/posts/lambda-induccion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-27 Fri 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inducción estructural</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="../css/default.css" />
<link rel="stylesheet" href="../css/mathjax_fonts.css" />
<link rel="stylesheet" href="../css/syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="../index.html">Mario Román</a>
</div>
<div id="navigation">
<a href="../index.html">About</a>
<a href="../posts/index.html">Blog</a>
<a href="https://github.com/mroman42/">Github</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Inducción estructural</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org197da78">Conjuntos bien fundados</a></li>
<li><a href="#org1ac7fa7">Inducción sobre tipos</a></li>
<li><a href="#org2679706">Ejemplo 1: Naturales</a></li>
<li><a href="#org28e0de8">Ejemplo 2: Árboles binarios</a></li>
</ul>
</div>
</div>
<p>
Normalmente aplicamos inducción sobre los números naturales, y cuando
necesitamos aplicar inducción en otro contexto lo hacemos corresponder con los 
números naturales. Por ejemplo, si queremos demostrar una propiedad sobre los
árboles binarios, la demostraríamos por inducción sobre la altura del
árbol. Pero el proceso de llevar todo a los naturales puede ser
incómodo, tedioso y puede complicar la demostración innecesariamente. En
este post vamos a desarrollar una forma de ampliar la inducción a la
estructura de los tipos de datos para simplificar todas esas
demostraciones.
</p>

<div id="outline-container-org197da78" class="outline-2">
<h2 id="org197da78">Conjuntos bien fundados</h2>
<div class="outline-text-2" id="text-org197da78">
<p>
Vamos a definir las relaciones bien fundadas, que nos permitirán definir
una inducción generalizada. [1]
</p>

<ul class="org-ul">
<li><b>Relación bien fundada:</b> una relación en un conjunto de elementos
es bien fundada si todo subconjunto no vacío tiene un elemento
minimal. Dado un orden parcial, es bien fundado si todo subconjunto
no vacío tiene un elemento tal que ninguno es menor que él.</li>
</ul>

<p>
Y podemos realizar inducción sobre cualquier conjunto con una relación
bien fundada.
</p>

<ul class="org-ul">
<li><p>
<b>Inducción noetheriana:</b> sea X un conjunto bien fundado con
A ⊂ X. Si se cumple:
</p>

<p>
(y &lt; x =&gt; y ∈ A) =&gt; x ∈ A
</p>

<p>
Entonces A = X.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org1ac7fa7" class="outline-2">
<h2 id="org1ac7fa7">Inducción sobre tipos</h2>
<div class="outline-text-2" id="text-org1ac7fa7">
<p>
Ahora vamos a aplicar esto a teoría de tipos. Sea un tipo con sus
constructores. Para todas las instancias constructibles del tipo (es decir,
aquellas que pueden
generarse en un número finito de pasos desde sus constructores),
definimos un orden parcial:
</p>

<ul class="org-ul">
<li><p>
<b>Orden constructivo:</b> para dos instancias del tipo: a, b : A,
b <i>se construye con</i> a si el constructor de b toma a
como argumento. La clausura transitiva de esta relación forma un
orden parcial:
</p>

<p>
a ≤ b  =&gt;  a  se usa en la construcción de  b 
</p></li>
</ul>

<p>
Y ahora tenemos una inducción sobre los constructores de los tipos, que
describimos ahora.
</p>

<ul class="org-ul">
<li><p>
<b>Inducción sobre tipos</b>: sea un tipo A con constructores y sea
P : A -&gt; Bool una propiedad. Siendo
a₁, a₂ &#x2026; aᵢ : A argumentos del constructor, si se cumple
la condición de inducción para cada constructor Cᵢ:
</p>

<p>
P(a₁) ∧ P(a₂) ∧ &#x2026; ∧ P(aᵢ)  =&gt;  P(Cᵢ(a₁,a₂,&#x2026;,b₀,b₁,&#x2026;))
</p></li>
</ul>

<p>
Entonces a : A =&gt; P(a).
</p>
</div>
</div>

<div id="outline-container-org2679706" class="outline-2">
<h2 id="org2679706">Ejemplo 1: Naturales</h2>
<div class="outline-text-2" id="text-org2679706">
<p>
Nuestro primer ejemplo va a ser obtener la inducción sobre los naturales
como caso particular. Damos una definición de los naturales en lenguaje
Haskell, con los axiomas de Peano, un natural es 0 o el siguiente de un
natural:
</p>

<div class="org-src-container">
<pre class="src src-haskell">    <span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Nat</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">O</span>
             <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">S</span> <span style="color: #ce537a; font-weight: bold;">Nat</span>
</pre>
</div>

<p>
Que equivale a la definición en Coq:
</p>

<pre class="example">
    Inductive nat : Type :=
      | O : nat
      | S : nat -&gt; nat
</pre>

<p>
Es decir, si lo demostramos para <code>0</code> y para <code>S n</code> sabiéndolo para <code>n</code>,
lo hemos demostrado para todos los naturales.
</p>
</div>
</div>

<div id="outline-container-org28e0de8" class="outline-2">
<h2 id="org28e0de8">Ejemplo 2: Árboles binarios</h2>
<div class="outline-text-2" id="text-org28e0de8">
<p>
Ahora vamos a intentar el ejemplo que motivó esta búsqueda. Definimos un
árbol binario como un árbol vacío o como un nodo del que surgen dos
árboles binarios, en Haskell:
</p>

<div class="org-src-container">
<pre class="src src-haskell">    <span style="color: #4f97d7; font-weight: bold;">data</span> <span style="color: #ce537a; font-weight: bold;">Tree</span> a <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">Empty</span>
                <span style="color: #7590db;">|</span> <span style="color: #ce537a; font-weight: bold;">Node</span> a <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Tree</span> a<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">Tree</span> a<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Que equivale a la definición en Coq:
</p>

<pre class="example">
    Inductive tree (X:Type) : Type :=
      | nilt : tree X
      | node : X -&gt; tree X -&gt; tree X -&gt; tree X.
</pre>

<p>
Es decir, si demostramos una propiedad para el árbol vacío y para un
árbol sabiendo que la cumplen sus subárboles derecho e izquierdo, la
hemos demostrado para todos los árboles binarios.
</p>

<p>
En el repositorio <a href="https://github.com/MROMAN42/recorridosArboles">mroman42/recorridosArboles</a> hay
varias demostraciones por inducción sobre árboles binarios, explicados
en lenguaje natural y demostrados luego sobre el asistente de
demostraciones Coq.
</p>

<p>
[1] Post sobre generalizaciones de la inducción <a href="http://math.blogoverflow.com/2015/03/10/when-can-we-do-induction/">en Stack Overflow</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><p class="date">Last edited 2019-12-27 15:49:41 by Mario Román (<a href="https://github.com/mroman42/cosmoi">code</a>).</p>
</div>
</body>
</html>
